app/controllers/class_statuses_controller.rb

  def destroy
  	user_id = @class_status.user_id
  	class_list_id = @class_status.class_list_id

  	ClassStatus.minus_credits(user_id, class_list_id)

  	@class_status.destroy
---
DELETE FROM "class_statuses" WHERE "class_statuses"."id" = $1  [["id", 1]]

    def set_class_status
      @class_status = ClassStatus.find(params[:id])
---
SELECT "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]