app/controllers/class_statuses_controller.rb

  def index
    @class_statuses = ClassStatus.all
---
SELECT "class_statuses".* FROM "class_statuses"

  def create
    @class_status = ClassStatus.new(class_status_params)
	user_id = @class_status.user_id
	class_id = @class_status.class_list_id
	@class_status_overlap = ClassStatus.where(user_id: user_id, class_list_id: class_id).size
	@class_status_size = ClassStatus.where(class_list_id: class_id).size

	puts "현재 사이즈 수 : #{@class_status_overlap}"
	puts "유저ID : #{user_id}"
	puts "강의ID : #{class_id}"

    respond_to do |format|
      if ClassStatus.applied?(user_id, class_id)
		format.html { redirect_to root_path, notice: '중복신청은 되지 않습니다.'}

	  elsif ClassStatus.exceeds_capacity?(class_id)
		format.html { redirect_to root_path, notice: '수강인원을 초과할 수 없습니다.' }

	  elsif ClassStatus.exceeds_credit?(user_id)
      	format.html { redirect_to root_path, notice: '18 학점을 초과할 수 없습니다.' }

	  else
        @class_status.save
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."user_id" = $1 AND "class_statuses"."class_list_id" = $2  [["user_id", 1], ["class_list_id", 1]]
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]
INSERT INTO "class_statuses" ("user_id", "class_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["class_list_id", 5], ["created_at", "2024-10-18 06:00:36.208752"], ["updated_at", "2024-10-18 06:00:36.208752"]]

  def show_users
	@class_list = ClassList.find(params[:class_list_id])
---
SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def destroy
  	user_id = @class_status.user_id
  	class_list_id = @class_status.class_list_id

  	ClassStatus.minus_credits(user_id, class_list_id)

  	@class_status.destroy
---
DELETE FROM "class_statuses" WHERE "class_statuses"."id" = $1  [["id", 42]]

    def set_class_status
      @class_status = ClassStatus.find(params[:id])
---
SELECT "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]