app/controllers/products_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
  def show
	  @reviews = Review.where(product_id: @product.id)

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "도라에몽 피규어"], ["description", "일본 만화 도라에몽 피규어"], ["price", 30000], ["created_at", "2024-10-11 10:49:04.354227"], ["updated_at", "2024-10-11 10:49:04.354227"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save