app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("content", "rating", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "ㅎㅇ"], ["rating", 5], ["product_id", 4], ["created_at", "2024-10-11 10:57:39.288250"], ["updated_at", "2024-10-11 10:57:39.288250"]]