app/models/class_status.rb

  def overlap?
  ClassStatus.where(user_id: self.user_id, class_list_id: self.class_list_id).size
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."user_id" = $1 AND "class_statuses"."class_list_id" = $2  [["user_id", 1], ["class_list_id", 4]]

  def full?
  ClassStatus.where(class_list_id: self.class_list_id).size >= ClassList.find(self.class_list_id).c_account
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]

  def self.exceeds_capacity?(class_list_id)
	  current_size = where(class_list_id: class_list_id).size
	  max_capacity = ClassList.find(class_list_id).c_account
---
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 4]]
SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def self.exceeds_credit?(user_id, max_credits = 18)
    current_credits = ClassStatus.where(user_id: user_id).joins(:class_list).sum('class_lists.credits')
---
SELECT SUM(class_lists.credits) FROM "class_statuses" INNER JOIN "class_lists" ON "class_lists"."id" = "class_statuses"."class_list_id" WHERE "class_statuses"."user_id" = $1  [["user_id", 1]]

  def self.minus_credits(user_id, class_list_id)
    class_list = ClassList.find(class_list_id)
    class_credit = class_list.credits
    current_credits = ClassStatus.where(user_id: user_id).joins(:class_list).sum('class_lists.credits')
---
SELECT "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT SUM(class_lists.credits) FROM "class_statuses" INNER JOIN "class_lists" ON "class_lists"."id" = "class_statuses"."class_list_id" WHERE "class_statuses"."user_id" = $1  [["user_id", 1]]